Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV70J20.xml
        <register caption="Conversion Data Register 1" name="DACC_CDR1" offset="0x20" rw="W" size="4">
          <bitfield caption="Data to Convert for channel 0" mask="0x0000FFFF" name="DATA0"/>
          <bitfield caption="Data to Convert for channel 1" mask="0xFFFF0000" name="DATA1"/>
        </register>
        <register caption="Interrupt Enable Register" name="DACC_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="Transmit Ready Interrupt Enable of channel 0" mask="0x00000001" name="TXRDY0"/>
          <bitfield caption="Transmit Ready Interrupt Enable of channel 1" mask="0x00000002" name="TXRDY1"/>
          <bitfield caption="End of Conversion Interrupt Enable of channel 0" mask="0x00000010" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Enable of channel 1" mask="0x00000020" name="EOC1"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable of channel 0" mask="0x00000100" name="ENDTX0"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable of channel 1" mask="0x00000200" name="ENDTX1"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable of channel 0" mask="0x00001000" name="TXBUFE0"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable of channel 1" mask="0x00002000" name="TXBUFE1"/>
        </register>
        <register caption="Interrupt Disable Register" name="DACC_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="Transmit Ready Interrupt Disable of channel 0" mask="0x00000001" name="TXRDY0"/>
          <bitfield caption="Transmit Ready Interrupt Disable of channel 1" mask="0x00000002" name="TXRDY1"/>
          <bitfield caption="End of Conversion Interrupt Disable of channel 0" mask="0x00000010" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Disable of channel 1" mask="0x00000020" name="EOC1"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable of channel 0" mask="0x00000100" name="ENDTX0"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable of channel 1" mask="0x00000200" name="ENDTX1"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable of channel 0" mask="0x00001000" name="TXBUFE0"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable of channel 1" mask="0x00002000" name="TXBUFE1"/>
        </register>
        <register caption="Interrupt Mask Register" name="DACC_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="Transmit Ready Interrupt Mask of channel 0" mask="0x00000001" name="TXRDY0"/>
          <bitfield caption="Transmit Ready Interrupt Mask of channel 1" mask="0x00000002" name="TXRDY1"/>
          <bitfield caption="End of Conversion Interrupt Mask of channel 0" mask="0x00000010" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Mask of channel 1" mask="0x00000020" name="EOC1"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask of channel 0" mask="0x00000100" name="ENDTX0"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask of channel 1" mask="0x00000200" name="ENDTX1"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask of channel 0" mask="0x00001000" name="TXBUFE0"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask of channel 1" mask="0x00002000" name="TXBUFE1"/>
        </register>
        <register caption="Interrupt Status Register" name="DACC_ISR" offset="0x30" rw="R" size="4">
          <bitfield caption="Transmit Ready Interrupt Flag of channel 0" mask="0x00000001" name="TXRDY0"/>
          <bitfield caption="Transmit Ready Interrupt Flag of channel 1" mask="0x00000002" name="TXRDY1"/>
          <bitfield caption="End of Conversion Interrupt Flag of channel 0" mask="0x00000010" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Flag of channel 1" mask="0x00000020" name="EOC1"/>
          <bitfield caption="End of DMA Interrupt Flag of channel 0" mask="0x00000100" name="ENDTX0"/>
          <bitfield caption="End of DMA Interrupt Flag of channel 1" mask="0x00000200" name="ENDTX1"/>
          <bitfield caption="Transmit Buffer Empty of channel 0" mask="0x00001000" name="TXBUFE0"/>
          <bitfield caption="Transmit Buffer Empty of channel 1" mask="0x00002000" name="TXBUFE1"/>
        </register>
        <register caption="Analog Current Register" name="DACC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Analog Output Current Control" mask="0x00000003" name="IBCTLCH0"/>
          <bitfield caption="Analog Output Current Control" mask="0x0000000C" name="IBCTLCH1"/>
        </register>
        <register caption="Write Protection Mode register" name="DACC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect Key" mask="0xFFFFFF00" name="WPKEY" values="DACC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status register" name="DACC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
        <register caption="Version Register" name="DACC_VERSION" offset="0xFC" rw="R" size="4">
          <bitfield caption="Version" mask="0x00000FFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x00070000" name="MFN"/>
        </register>
      </register-group>
      <value-group caption="" name="DACC_MR__MAXS0">
        <value caption="Triggered by selected event" name="TRIG_EVENT" value="0"/>
        <value caption="Max Speed Mode enabled" name="MAXIMUM" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__MAXS1">
        <value caption="Triggered by selected event" name="TRIG_EVENT" value="0"/>
        <value caption="Max Speed Mode enabled" name="MAXIMUM" value="1"/>
      </value-group>
