Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV70J20.xml
      <value-group caption="" name="DACC_MR__WORD">
        <value caption="One data to convert is written to the FIFO per access to DACC" name="DISABLED" value="0"/>
        <value caption="Two data to convert are written to the FIFO per access to DACC (reduces number of requests to DMA and the number of system bus accesses)" name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_MR__DIFF">
        <value caption="DAC0 and DAC1 outputs can be separately configured" name="DISABLED" value="0"/>
        <value caption="DACP and DACN outputs are configured by the channel 0 value." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__TRGEN0">
        <value caption="External trigger mode disabled. DAC is in free running mode." name="DIS" value="0"/>
        <value caption="External trigger mode enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__TRGEN1">
        <value caption="External trigger mode disabled. DAC is in free running mode." name="DIS" value="0"/>
        <value caption="External trigger mode enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__TRGSEL0">
        <value caption="TC0 output" name="TRGSEL0" value="0x0"/>
        <value caption="TC1 output" name="TRGSEL1" value="0x1"/>
        <value caption="TC2 output" name="TRGSEL2" value="0x2"/>
        <value caption="PWM0 event 0" name="TRGSEL3" value="0x3"/>
        <value caption="PWM0 event 1" name="TRGSEL4" value="0x4"/>
        <value caption="PWM1 event 0" name="TRGSEL5" value="0x5"/>
        <value caption="PWM1 event 1" name="TRGSEL6" value="0x6"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__TRGSEL1">
        <value caption="TC0 output" name="TRGSEL0" value="0x0"/>
        <value caption="TC1 output" name="TRGSEL1" value="0x1"/>
        <value caption="TC2 output" name="TRGSEL2" value="0x2"/>
        <value caption="PWM0 event 0" name="TRGSEL3" value="0x3"/>
        <value caption="PWM0 event 1" name="TRGSEL4" value="0x4"/>
        <value caption="PWM1 event 0" name="TRGSEL5" value="0x5"/>
        <value caption="PWM1 event 1" name="TRGSEL6" value="0x6"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__OSR0">
        <value caption="OSR = 1" name="OSR_1" value="0x0"/>
        <value caption="OSR = 2" name="OSR_2" value="0x1"/>
        <value caption="OSR = 4" name="OSR_4" value="0x2"/>
        <value caption="OSR = 8" name="OSR_8" value="0x3"/>
        <value caption="OSR = 16" name="OSR_16" value="0x4"/>
        <value caption="OSR = 32" name="OSR_32" value="0x5"/>
      </value-group>
      <value-group caption="" name="DACC_TRIGR__OSR1">
        <value caption="OSR = 1" name="OSR_1" value="0x0"/>
        <value caption="OSR = 2" name="OSR_2" value="0x1"/>
        <value caption="OSR = 4" name="OSR_4" value="0x2"/>
        <value caption="OSR = 8" name="OSR_8" value="0x3"/>
        <value caption="OSR = 16" name="OSR_16" value="0x4"/>
        <value caption="OSR = 32" name="OSR_32" value="0x5"/>
      </value-group>
      <value-group caption="" name="DACC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0." name="PASSWD" value="0x444143"/>
      </value-group>
    </module>
    <module caption="Embedded Flash Controller" name="EFC" version="6450V">
      <register-group name="EFC">
        <register caption="EEFC Flash Mode Register" name="EEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Flash Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Wait State" mask="0x00000F00" name="FWS"/>
          <bitfield caption="Sequential Code Optimization Disable" mask="0x00010000" name="SCOD"/>
          <bitfield caption="Code Loop Optimization Enable" mask="0x04000000" name="CLOE"/>
        </register>
        <register caption="EEFC Flash Command Register" name="EEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="EEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="EEFC_FCR__FKEY"/>
        </register>
        <register caption="EEFC Flash Status Register" name="EEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status (cleared when Flash is busy)" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status (cleared on read or by writing EEFC_FCR)" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status (cleared on read)" mask="0x00000004" name="FLOCKE"/>
          <bitfield caption="Flash Error Status (cleared when a programming operation starts)" mask="0x00000008" name="FLERR"/>
          <bitfield caption="Unique ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00010000" name="UECCELSB"/>
          <bitfield caption="Multiple ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00020000" name="MECCELSB"/>
          <bitfield caption="Unique ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00040000" name="UECCEMSB"/>
          <bitfield caption="Multiple ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00080000" name="MECCEMSB"/>
        </register>
        <register caption="EEFC Flash Result Register" name="EEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
        <register caption="EEFC Version Register" name="EEFC_VERSION" offset="0x14" rw="R" size="4">
          <bitfield caption="Version of the Hardware Module" mask="0x00000FFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x00070000" name="MFN"/>
        </register>
