Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV70J20.xml
        <register caption="MIF Data Write Enable 0 Register 0" name="MLB_MDWE0" offset="0xD0" rw="RW" size="4">
          <bitfield caption="Bitwise write enable for CTR data - bits[31:0]" mask="0xFFFFFFFF" name="MASK"/>
        </register>
        <register caption="MIF Data Write Enable 0 Register 1" name="MLB_MDWE1" offset="0xD4" rw="RW" size="4">
          <bitfield caption="Bitwise write enable for CTR data - bits[31:0]" mask="0xFFFFFFFF" name="MASK"/>
        </register>
        <register caption="MIF Data Write Enable 0 Register 2" name="MLB_MDWE2" offset="0xD8" rw="RW" size="4">
          <bitfield caption="Bitwise write enable for CTR data - bits[31:0]" mask="0xFFFFFFFF" name="MASK"/>
        </register>
        <register caption="MIF Data Write Enable 0 Register 3" name="MLB_MDWE3" offset="0xDC" rw="RW" size="4">
          <bitfield caption="Bitwise write enable for CTR data - bits[31:0]" mask="0xFFFFFFFF" name="MASK"/>
        </register>
        <register caption="MIF Control Register" name="MLB_MCTL" offset="0x0E0" rw="RW" size="4">
          <bitfield caption="Transfer Complete (Write 0 to Clear)" mask="0x00000001" name="XCMP"/>
        </register>
        <register caption="MIF Address Register" name="MLB_MADR" offset="0x0E4" rw="RW" size="4">
          <bitfield caption="CTR or DBR Address" mask="0x00003FFF" name="ADDR"/>
          <bitfield caption="Target Location Bit" mask="0x40000000" name="TB" values="MLB_MADR__TB"/>
          <bitfield caption="Write-Not-Read Selection" mask="0x80000000" name="WNR"/>
        </register>
        <register caption="AHB Control Register" name="MLB_ACTL" offset="0x3C0" rw="RW" size="4">
          <bitfield caption="Software Clear Enable" mask="0x00000001" name="SCE"/>
          <bitfield caption="AHB Interrupt Mux Enable" mask="0x00000002" name="SMX"/>
          <bitfield caption="DMA Mode" mask="0x00000004" name="DMA_MODE"/>
          <bitfield caption="DMA Packet Buffering Mode" mask="0x00000010" name="MPB" values="MLB_ACTL__MPB"/>
        </register>
        <register caption="AHB Channel Status 0 Register 0" name="MLB_ACSR0" offset="0x3D0" rw="RW" size="4">
          <bitfield caption="Interrupt Status for Logical Channels [31:0] (cleared by writing a 1)" mask="0xFFFFFFFF" name="CHS"/>
        </register>
        <register caption="AHB Channel Status 0 Register 1" name="MLB_ACSR1" offset="0x3D4" rw="RW" size="4">
          <bitfield caption="Interrupt Status for Logical Channels [31:0] (cleared by writing a 1)" mask="0xFFFFFFFF" name="CHS"/>
        </register>
        <register caption="AHB Channel Mask 0 Register 0" name="MLB_ACMR0" offset="0x3D8" rw="RW" size="4">
          <bitfield caption="Bitwise Channel Mask Bits 31 to 0" mask="0xFFFFFFFF" name="CHM"/>
        </register>
        <register caption="AHB Channel Mask 0 Register 1" name="MLB_ACMR1" offset="0x3DC" rw="RW" size="4">
          <bitfield caption="Bitwise Channel Mask Bits 31 to 0" mask="0xFFFFFFFF" name="CHM"/>
        </register>
      </register-group>
      <value-group caption="" name="MLB_MLBC0__MLBCLK">
        <value caption="256xFs (for MLBPEN = 0)" name="_256_FS" value="0x0"/>
        <value caption="512xFs (for MLBPEN = 0)" name="_512_FS" value="0x1"/>
        <value caption="1024xFs (for MLBPEN = 0)" name="_1024_FS" value="0x2"/>
      </value-group>
      <value-group caption="" name="MLB_MLBC0__FCNT">
        <value caption="1 frame per sub-buffer (Operation is the same as Standard mode.)" name="_1_FRAME" value="0x0"/>
        <value caption="2 frames per sub-buffer" name="_2_FRAMES" value="0x1"/>
        <value caption="4 frames per sub-buffer" name="_4_FRAMES" value="0x2"/>
        <value caption="8 frames per sub-buffer" name="_8_FRAMES" value="0x3"/>
        <value caption="16 frames per sub-buffer" name="_16_FRAMES" value="0x4"/>
        <value caption="32 frames per sub-buffer" name="_32_FRAMES" value="0x5"/>
        <value caption="64 frames per sub-buffer" name="_64_FRAMES" value="0x6"/>
      </value-group>
      <value-group caption="" name="MLB_MADR__TB">
        <value caption="Selects CTR" name="CTR" value="0"/>
        <value caption="Selects DBR" name="DBR" value="1"/>
      </value-group>
      <value-group caption="" name="MLB_ACTL__MPB">
        <value caption="Single-packet mode" name="SINGLE_PACKET" value="0"/>
        <value caption="Multiple-packet mode" name="MULTIPLE_PACKET" value="1"/>
      </value-group>
    </module>
    <module caption="Parallel Input/Output Controller" name="PIO" version="11004T">
      <register-group name="PIO">
        <register caption="PIO Enable Register" name="PIO_PER" offset="0x0000" rw="W" size="4">
          <bitfield caption="PIO Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Disable Register" name="PIO_PDR" offset="0x0004" rw="W" size="4">
          <bitfield caption="PIO Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Status Register" name="PIO_PSR" offset="0x0008" rw="R" size="4">
          <bitfield caption="PIO Status" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Status" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Status" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Status" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Status" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Status" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Status" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Status" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Status" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Status" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Status" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Status" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Status" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Status" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Status" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Status" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Status" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Status" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Status" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Status" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Status" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Status" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Status" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Status" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Status" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Status" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Status" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Status" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Status" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Status" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Status" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Enable Register" name="PIO_OER" offset="0x0010" rw="W" size="4">
          <bitfield caption="Output Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Disable Register" name="PIO_ODR" offset="0x0014" rw="W" size="4">
          <bitfield caption="Output Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Status Register" name="PIO_OSR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Output Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Glitch Input Filter Enable Register" name="PIO_IFER" offset="0x0020" rw="W" size="4">
          <bitfield caption="Input Filter Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Filter Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Filter Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Filter Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Filter Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Filter Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Filter Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Filter Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Filter Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Filter Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Filter Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Filter Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Filter Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Filter Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Filter Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Filter Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Filter Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Filter Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Filter Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Filter Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Filter Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Filter Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Filter Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Filter Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Filter Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Filter Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Filter Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Filter Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Filter Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Filter Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Filter Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Filter Enable" mask="0x80000000" name="P31"/>
        </register>
