Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV70J20.xml
      <value-group caption="" name="CKGR_MOR__MOSCRCF">
        <value caption="Fast RC oscillator frequency is at 4 MHz (default)" name="_4_MHz" value="0x0"/>
        <value caption="Fast RC oscillator frequency is at 8 MHz" name="_8_MHz" value="0x1"/>
        <value caption="Fast RC oscillator frequency is at 12 MHz" name="_12_MHz" value="0x2"/>
      </value-group>
      <value-group caption="" name="CKGR_MOR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x37"/>
      </value-group>
      <value-group caption="" name="CKGR_PLLAR__DIVA">
        <value caption="Divider output is 0 and PLLA is disabled." name="_0" value="0"/>
        <value caption="Divider is bypassed (divide by 1) and PLLA is enabled." name="BYPASS" value="1"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="Divided UPLL Clock  is selected" name="UPLL_CLK" value="0x3"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
        <value caption="Selected clock divided by 3" name="CLK_3" value="0x7"/>
      </value-group>
      <value-group caption="" name="PMC_MCKR__MDIV">
        <value caption="Master Clock is Prescaler Output Clock divided by 1." name="EQ_PCK" value="0x0"/>
        <value caption="Master Clock is Prescaler Output Clock divided by 2." name="PCK_DIV2" value="0x1"/>
        <value caption="Master Clock is Prescaler Output Clock divided by 4." name="PCK_DIV4" value="0x2"/>
        <value caption="Master Clock is Prescaler Output Clock divided by 3." name="PCK_DIV3" value="0x3"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="Divided UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="Divided UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="Divided UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="Divided UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="Divided UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="Divided UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_PCK__CSS">
        <value caption="Slow Clock is selected" name="SLOW_CLK" value="0x0"/>
        <value caption="Main Clock is selected" name="MAIN_CLK" value="0x1"/>
        <value caption="PLLA Clock is selected" name="PLLA_CLK" value="0x2"/>
        <value caption="Divided UPLL Clock is selected" name="UPLL_CLK" value="0x3"/>
        <value caption="Master Clock is selected" name="MCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="PMC_FSMR__FLPM">
        <value caption="Flash is in Standby Mode when system enters Wait Mode" name="FLASH_STANDBY" value="0x0"/>
        <value caption="Flash is in Deep-power-down mode when system enters Wait Mode" name="FLASH_DEEP_POWERDOWN" value="0x1"/>
        <value caption="Idle mode" name="FLASH_IDLE" value="0x2"/>
      </value-group>
      <value-group caption="" name="PMC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x504D43"/>
      </value-group>
      <value-group caption="" name="PMC_PCR__DIV">
        <value caption="Peripheral clock is MCK" name="PERIPH_DIV_MCK" value="0x0"/>
        <value caption="Peripheral clock is MCK/2" name="PERIPH_DIV2_MCK" value="0x1"/>
        <value caption="Peripheral clock is MCK/4" name="PERIPH_DIV4_MCK" value="0x2"/>
        <value caption="Peripheral clock is MCK/8" name="PERIPH_DIV8_MCK" value="0x3"/>
      </value-group>
    </module>
    <module caption="Pulse Width Modulation Controller" name="PWM" version="6343R">
      <register-group name="PWM">
        <register caption="PWM Clock Register" name="PWM_CLK" offset="0x00" rw="RW" size="4">
          <bitfield caption="CLKA Divide Factor" mask="0x000000FF" name="DIVA" values="PWM_CLK__DIVA"/>
          <bitfield caption="CLKA Source Clock Selection" mask="0x00000F00" name="PREA" values="PWM_CLK__PREA"/>
          <bitfield caption="CLKB Divide Factor" mask="0x00FF0000" name="DIVB" values="PWM_CLK__DIVB"/>
          <bitfield caption="CLKB Source Clock Selection" mask="0x0F000000" name="PREB" values="PWM_CLK__PREB"/>
        </register>
