Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV70J20.xml
        <register caption="Interrupt Mask Register" name="US_IMR" offset="0x0010" rw="R" size="4">
          <bitfield caption="RXRDY Interrupt Mask" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Mask" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Mask" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Mask" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Mask" mask="0x00000080" name="PARE"/>
          <bitfield caption="Time-out Interrupt Mask" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Mask" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Clear to Send Input Change Interrupt Mask" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Manchester Error Interrupt Mask" mask="0x01000000" name="MANE"/>
        </register>
        <register caption="Channel Status Register" name="US_CSR" offset="0x0014" rw="R" size="4">
          <bitfield caption="Receiver Ready (cleared by reading US_RHR)" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Transmitter Ready (cleared by writing US_THR)" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error (cleared by writing a one to bit US_CR.RSTSTA)" mask="0x00000080" name="PARE"/>
          <bitfield caption="Receiver Time-out (cleared by writing a one to bit US_CR.STTTO)" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="Transmitter Empty (cleared by writing US_THR)" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Clear to Send Input Change Flag (cleared on read)" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Image of CTS Input" mask="0x00800000" name="CTS"/>
          <bitfield caption="Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA)" mask="0x01000000" name="MANERR"/>
        </register>
        <register caption="Receive Holding Register" name="US_RHR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000001FF" name="RXCHR"/>
          <bitfield caption="Received Sync" mask="0x00008000" name="RXSYNH"/>
        </register>
        <register caption="Transmit Holding Register" name="US_THR" offset="0x001C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000001FF" name="TXCHR"/>
          <bitfield caption="Sync Field to be Transmitted" mask="0x00008000" name="TXSYNH"/>
        </register>
        <register caption="Baud Rate Generator Register" name="US_BRGR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x0000FFFF" name="CD"/>
          <bitfield caption="Fractional Part" mask="0x00070000" name="FP"/>
        </register>
        <register caption="Receiver Time-out Register" name="US_RTOR" offset="0x0024" rw="RW" size="4">
          <bitfield caption="Time-out Value" mask="0x0001FFFF" name="TO"/>
        </register>
        <register caption="Transmitter Timeguard Register" name="US_TTGR" offset="0x0028" rw="RW" size="4">
          <bitfield caption="Timeguard Value" mask="0x000000FF" name="TG"/>
        </register>
        <register caption="Manchester Configuration Register" name="US_MAN" offset="0x0050" rw="RW" size="4">
          <bitfield caption="Transmitter Preamble Length" mask="0x0000000F" name="TX_PL"/>
          <bitfield caption="Transmitter Preamble Pattern" mask="0x00000300" name="TX_PP" values="US_MAN__TX_PP"/>
          <bitfield caption="Transmitter Manchester Polarity" mask="0x00001000" name="TX_MPOL"/>
          <bitfield caption="Receiver Preamble Length" mask="0x000F0000" name="RX_PL"/>
          <bitfield caption="Receiver Preamble Pattern detected" mask="0x03000000" name="RX_PP" values="US_MAN__RX_PP"/>
          <bitfield caption="Receiver Manchester Polarity" mask="0x10000000" name="RX_MPOL"/>
          <bitfield caption="Must Be Set to 1" mask="0x20000000" name="ONE"/>
          <bitfield caption="Drift Compensation" mask="0x40000000" name="DRIFT"/>
          <bitfield mask="0x80000000" name="RXIDLEV"/>
        </register>
        <register caption="LIN Mode Register" name="US_LINMR" offset="0x0054" rw="RW" size="4">
          <bitfield caption="LIN Node Action" mask="0x00000003" name="NACT" values="US_LINMR__NACT"/>
          <bitfield caption="Parity Disable" mask="0x00000004" name="PARDIS"/>
          <bitfield caption="Checksum Disable" mask="0x00000008" name="CHKDIS"/>
          <bitfield caption="Checksum Type" mask="0x00000010" name="CHKTYP"/>
          <bitfield caption="Data Length Mode" mask="0x00000020" name="DLM"/>
          <bitfield caption="Frame Slot Mode Disable" mask="0x00000040" name="FSDIS"/>
          <bitfield caption="Wakeup Signal Type" mask="0x00000080" name="WKUPTYP"/>
          <bitfield caption="Data Length Control" mask="0x0000FF00" name="DLC"/>
          <bitfield caption="DMAC Mode" mask="0x00010000" name="PDCM"/>
          <bitfield caption="Synchronization Disable" mask="0x00020000" name="SYNCDIS"/>
        </register>
        <register caption="LIN Identifier Register" name="US_LINIR" offset="0x0058" rw="RW" size="4">
          <bitfield caption="Identifier Character" mask="0x000000FF" name="IDCHR"/>
        </register>
        <register caption="LIN Baud Rate Register" name="US_LINBRR" offset="0x005C" rw="R" size="4">
          <bitfield caption="Clock Divider after Synchronization" mask="0x0000FFFF" name="LINCD"/>
          <bitfield caption="Fractional Part after Synchronization" mask="0x00070000" name="LINFP"/>
        </register>
        <register caption="LON Mode Register" name="US_LONMR" offset="0x0060" rw="RW" size="4">
          <bitfield caption="LON comm_type Parameter Value" mask="0x00000001" name="COMMT"/>
          <bitfield caption="LON Collision Detection Feature" mask="0x00000002" name="COLDET"/>
          <bitfield caption="Terminate Frame upon Collision Notification" mask="0x00000004" name="TCOL"/>
          <bitfield caption="LON Collision Detection on Frame Tail" mask="0x00000008" name="CDTAIL"/>
          <bitfield caption="LON DMA Mode" mask="0x00000010" name="DMAM"/>
          <bitfield caption="LON Collision Detection Source" mask="0x00000020" name="LCDS"/>
          <bitfield caption="End of Frame Condition Size" mask="0x00FF0000" name="EOFS"/>
        </register>
        <register caption="LON Preamble Register" name="US_LONPR" offset="0x0064" rw="RW" size="4">
          <bitfield caption="LON Preamble Length" mask="0x00003FFF" name="LONPL"/>
        </register>
        <register caption="LON Data Length Register" name="US_LONDL" offset="0x0068" rw="RW" size="4">
          <bitfield caption="LON Data Length" mask="0x000000FF" name="LONDL"/>
        </register>
        <register caption="LON L2HDR Register" name="US_LONL2HDR" offset="0x006C" rw="RW" size="4">
          <bitfield caption="LON Backlog Increment" mask="0x0000003F" name="BLI"/>
          <bitfield caption="LON Alternate Path Bit" mask="0x00000040" name="ALTP"/>
          <bitfield caption="LON Priority Bit" mask="0x00000080" name="PB"/>
        </register>
        <register caption="LON Backlog Register" name="US_LONBL" offset="0x0070" rw="R" size="4">
          <bitfield caption="LON Node Backlog Value" mask="0x0000003F" name="LONBL"/>
        </register>
