Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV70J20.xml
        <register caption="Device Endpoint Clear Register (n = 0) 1" name="USBHS_DEVEPTICR1" offset="0x164" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 2" name="USBHS_DEVEPTICR2" offset="0x168" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 3" name="USBHS_DEVEPTICR3" offset="0x16C" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 4" name="USBHS_DEVEPTICR4" offset="0x170" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 5" name="USBHS_DEVEPTICR5" offset="0x174" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 6" name="USBHS_DEVEPTICR6" offset="0x178" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 7" name="USBHS_DEVEPTICR7" offset="0x17C" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 8" name="USBHS_DEVEPTICR8" offset="0x180" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 9" name="USBHS_DEVEPTICR9" offset="0x184" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Set Register (n = 0) 0" name="USBHS_DEVEPTIFR0" offset="0x190" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Device Endpoint Set Register (n = 0) 1" name="USBHS_DEVEPTIFR1" offset="0x194" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Device Endpoint Set Register (n = 0) 2" name="USBHS_DEVEPTIFR2" offset="0x198" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Device Endpoint Set Register (n = 0) 3" name="USBHS_DEVEPTIFR3" offset="0x19C" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Device Endpoint Set Register (n = 0) 4" name="USBHS_DEVEPTIFR4" offset="0x1A0" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Device Endpoint Set Register (n = 0) 5" name="USBHS_DEVEPTIFR5" offset="0x1A4" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Device Endpoint Set Register (n = 0) 6" name="USBHS_DEVEPTIFR6" offset="0x1A8" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Device Endpoint Set Register (n = 0) 7" name="USBHS_DEVEPTIFR7" offset="0x1AC" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
